#include <stdio.h>

int main(void)
{
	int time[10000] = { 0, };
	int i, j;
	int N;
	int h1, m1, h2, m2;
	int start, end;
	int max;
	int mh, mm;
	int emh, emm;
	int check;

	scanf("%d", &N);

	for (i = 0; i < N; i++)
	{
		scanf("%d:%d %d:%d", &h1, &m1, &h2, &m2);

		start = h1 * 60 + m1;
		end = h2 * 60 + m2;

		for (j = start; j <= end; j++)
		{
			time[j] += 1;
		}
	}

	max = 0;

	for (i = 0; i <= 24 * 60; i++)
	{
		if (time[i] > max)
		{
			max = time[i];
		}
	}

	check = 0;
	for (i = 0; i <= 24 * 60; i++)
	{
		if (time[i] == max && check==0)
		{
			mh = i / 60;
			mm = i % 60;
			check = 1;
		}

		if (check == 1 && time[i] != max)
		{
			emh = (i-1) / 60;
			emm = (i-1) % 60;
			break;
		}
	}

	printf("%d\n", max);
	printf("%02d:%02d %02d:%02d", mh, mm, emh, emm);

	return 0;
}

/*


입력 예제 1
5
09:00 11:20
11:00 13:50
12:00 15:00
13:00 16:20
15:50 18:45 
출력 예제 1
3
13:00 13:50
입력 예제 2
2
09:00 09:59
10:00 11:00 
출력 예제 2
1
09:00 09:59
입력 예제 3
3
01:00 08:00
02:00 03:00
03:00 05:00  
출력 예제 3
2
02:00 05:00
입출력 예제 3번의 풀이를 보다 자세히 설명하면, 다음과 같다. 
1시부터 2시 직전까지는 1명의 유저가 로그인해 있다. 
2시가 되면 1명의 유저가 추가로 로그인하여 동시 접속한 유저의 수는 총 2명이다. 
이제 3시가 되면 1명의 유저가 로그아웃하는 동시에 다른 1명의 유저가 로그인하므로 동시 접속한 유저의 수는 계속해서 2명이다. 한 유저가 로그아웃하기 전 다른 유저가 로그인해서 동시 접속한 유저의 수가 3명이 되는 기간이 있거나, 한 유저가 로그아웃해서 동시 접속한 유저의 수가 1명이 된 다음 다른 유저가 로그인해서 동시 접속한 유저의 수가 다시 2명이 되는 것이 아님에 유의하시오. 따라서, 동시 접속한 유저의 수가 2명인 기간은 2시부터 5시 직전까지이다. 
5시가 되면 1명의 유저가 로그아웃하여 동시 접속한 유저 수가 1명이 된다

*/
